       IDENTIFICATION DIVISION.
       PROGRAM-ID. CUSTOMERPROG.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-CUSTOMER-NAME   PIC A(30).
       01 WS-CUSTOMER-ID     PIC 9(5).
       PROCEDURE DIVISION.
           DISPLAY "ENTER CUSTOMER ID: ".
           ACCEPT WS-CUSTOMER-ID.
           DISPLAY "CUSTOMER ID ENTERED: " WS-CUSTOMER-ID.
           STOP RUN.
